NET-SM/MSPM0L1306-system-lib/src/gpio.c
#include "mspm0l1306_gpio.h"
#include "mspm0_reg_utils.h"

void gpio_enable_power(void){

    GPIOA->GPRCM.PWREN = GPIO_PWREN_KEY_UNLOCK_W | 0x1;

}


void gpio_configure_interrupt(uint32_t pin, uint32_t edge)
{
 
    if (pin < 16){ 

        uint32_t shift =  pin * 2;
        GPIOA->POLARITY15_0 = (GPIOA->POLARITY15_0 &~ (0x3U << shift)) | (edge << shift);


    }else{

        uint32_t shift =  (pin - 16) * 2;
        GPIOA->POLARITY15_0 = (GPIOA->POLARITY15_0 &~ (0x3U << shift)) | (edge << shift);

    }

}

void gpio_enable_interrupt(uint32_t pin){

    uint32_t shifted_pin = 1U << pin;
    
    write_reg_bit(&GPIOA->CPU_INT.IMASK, pin, ENABLE);   
}

void gpio_clear_interrupt(uint32_t pin)
{
    uint32_t shifted_pin = 1U << pin;

    GPIOA->CPU_INT.ICLR =  shifted_pin;
}

uint32_t gpio_get_interrupt_status(uint32_t pin)
{
    uint32_t status = 0U;
    uint32_t shifted_pin = 1U << pin;

    if (GPIOA->CPU_INT.MIS & shifted_pin) status = 1U; 

    return status;
}